Autodesk.Revit.DB.Mechanical.DuctSettings.AirViscosity
The kinematic viscosity of air in ft^2/s.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for airKinematicViscosity must be non-negative.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSettings.AirDynamicViscosity
The dynamic viscosity of air in kg/(ft*s).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for airDynamicViscosity must be non-negative.
Since:
2025

Autodesk.Revit.DB.Mechanical.DuctSettings.AirDensity
The air density in kg/ft^3.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for airDensity must be non-negative.
Since:
2014